In [90]:
# https://www.encyclopedia-titanica.org/titanic-passengers-and-crew/
data_path='../../data/titanic/'
dataFile=data_path + 'titanicdata.htm'
import sys
import numpy as np

In [86]:
from bs4 import BeautifulSoup
with open(dataFile,"rb") as f:
    soup = BeautifulSoup(f,"html.parser")

Some characters could not be decoded, and were replaced with REPLACEMENT CHARACTER.

In [87]:
table = soup.find('table')

In [88]:
import pandas as pd
data = pd.read_html(str(table),flavor='bs4')[0]

In [89]:
data.head()

,Name,Age,Class/Dept,Ticket,Joined,Job,Boat [Body],Unnamed: 7
0,"ABī-AL-MUNà, Mr Nāsīf Qāsim",27,3rd Class Passenger,2699£18 15s 9d,Cherbourg,NaN,15,NaN
1,"ABBING, Mr Anthony",42,3rd Class Passenger,5547£7 11s,Southampton,Blacksmith,NaN,NaN
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,CA2673£20 5s,Southampton,NaN,A,NaN
3,"ABBOTT, Mr Rossmore Edward",16,3rd Class Passenger,CA2673£20 5s,Southampton,Jeweller,[190],NaN
4,"ABBOTT, Mr Eugene Joseph",13,3rd Class Passenger,CA2673£20 5s,Southampton,Scholar,NaN,NaN

In [91]:
data['Boat [Body]'] = data['Boat [Body]'].replace(np.nan, '', regex = True)

In [93]:
def cleanup(value):
    try:
        #print(value)
        return value.encode('utf-8', errors='ignore').decode('utf-8').replace("?"," ")
    except Exception as e:
        print(e.args)
        print(value)
        sys.exit()

In [94]:
data['Name']= data['Name'].apply(cleanup)

In [95]:
data['Boat [Body]']= data['Boat [Body]'].apply(cleanup)

In [96]:
data['Age'] = data['Age'].apply(pd.to_numeric, errors='coerce')

In [97]:
data = data[["Name","Age","Class/Dept","Boat [Body]"]]

data.head()

                            Name   Age           Class/Dept Boat [Body]
0    ABī-AL-MUNà, Mr Nāsīf Qāsim  27.0  3rd Class Passenger          15
1             ABBING, Mr Anthony  42.0  3rd Class Passenger
2  ABBOTT, Mrs Rhoda Mary 'Rosa'  39.0  3rd Class Passenger           A
3     ABBOTT, Mr Rossmore Edward  16.0  3rd Class Passenger       [190]
4       ABBOTT, Mr Eugene Joseph  13.0  3rd Class Passenger

In [98]:
def checkPass(class_type):
    if "Passenger" in class_type:
        return "Passenger"
    else:
        return "Crew"
    
data["Crew/Pass"]=data["Class/Dept"].apply(checkPass)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass
0,"ABī-AL-MUNà, Mr Nāsīf Qāsim",27.0,3rd Class Passenger,15,Passenger
1,"ABBING, Mr Anthony",42.0,3rd Class Passenger,,Passenger
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39.0,3rd Class Passenger,A,Passenger
3,"ABBOTT, Mr Rossmore Edward",16.0,3rd Class Passenger,[190],Passenger
4,"ABBOTT, Mr Eugene Joseph",13.0,3rd Class Passenger,,Passenger

In [99]:
def checkClass(class_type):
    if "Passenger" in class_type:
        return class_type.split(" ")[0]
    else:
        return "Crew"
    
data["Class"]=data["Class/Dept"].apply(checkClass)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class
0,"ABī-AL-MUNà, Mr Nāsīf Qāsim",27.0,3rd Class Passenger,15,Passenger,3rd
1,"ABBING, Mr Anthony",42.0,3rd Class Passenger,,Passenger,3rd
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39.0,3rd Class Passenger,A,Passenger,3rd
3,"ABBOTT, Mr Rossmore Edward",16.0,3rd Class Passenger,[190],Passenger,3rd
4,"ABBOTT, Mr Eugene Joseph",13.0,3rd Class Passenger,,Passenger,3rd

In [100]:
def checkAdult(age):
    if age>=18:
        return "Adult"
    else:
        return "Child"
    
data["Adult/Child"]=data["Age"].apply(checkAdult)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class,Adult/Child
0,"ABī-AL-MUNà, Mr Nāsīf Qāsim",27.0,3rd Class Passenger,15,Passenger,3rd,Adult
1,"ABBING, Mr Anthony",42.0,3rd Class Passenger,,Passenger,3rd,Adult
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39.0,3rd Class Passenger,A,Passenger,3rd,Adult
3,"ABBOTT, Mr Rossmore Edward",16.0,3rd Class Passenger,[190],Passenger,3rd,Child
4,"ABBOTT, Mr Eugene Joseph",13.0,3rd Class Passenger,,Passenger,3rd,Child

In [101]:
def checkGender(name):
    firstname = name[name.index(",")+2:]
    salutation = firstname.split(" ")[0]
    if salutation in ["Mr","Master"]:
        return "Male"
    else:
        return "Female"

In [102]:
data["Gender"]=data["Name"].apply(checkGender)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class,Adult/Child,Gender
0,"ABī-AL-MUNà, Mr Nāsīf Qāsim",27.0,3rd Class Passenger,15,Passenger,3rd,Adult,Male
1,"ABBING, Mr Anthony",42.0,3rd Class Passenger,,Passenger,3rd,Adult,Male
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39.0,3rd Class Passenger,A,Passenger,3rd,Adult,Female
3,"ABBOTT, Mr Rossmore Edward",16.0,3rd Class Passenger,[190],Passenger,3rd,Child,Male
4,"ABBOTT, Mr Eugene Joseph",13.0,3rd Class Passenger,,Passenger,3rd,Child,Male

In [103]:
data["Gender"]=data["Name"].apply(checkGender)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class,Adult/Child,Gender
0,"ABī-AL-MUNà, Mr Nāsīf Qāsim",27.0,3rd Class Passenger,15,Passenger,3rd,Adult,Male
1,"ABBING, Mr Anthony",42.0,3rd Class Passenger,,Passenger,3rd,Adult,Male
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39.0,3rd Class Passenger,A,Passenger,3rd,Adult,Female
3,"ABBOTT, Mr Rossmore Edward",16.0,3rd Class Passenger,[190],Passenger,3rd,Child,Male
4,"ABBOTT, Mr Eugene Joseph",13.0,3rd Class Passenger,,Passenger,3rd,Child,Male

In [105]:
def checkSurvival(boat):
    if boat.strip()=="" or "[" in boat:
        return 0
    else:
        return 1
data["Survival"]=data["Boat [Body]"].apply(checkSurvival)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class,Adult/Child,Gender,Survival
0,"ABī-AL-MUNà, Mr Nāsīf Qāsim",27.0,3rd Class Passenger,15,Passenger,3rd,Adult,Male,1
1,"ABBING, Mr Anthony",42.0,3rd Class Passenger,,Passenger,3rd,Adult,Male,0
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39.0,3rd Class Passenger,A,Passenger,3rd,Adult,Female,1
3,"ABBOTT, Mr Rossmore Edward",16.0,3rd Class Passenger,[190],Passenger,3rd,Child,Male,0
4,"ABBOTT, Mr Eugene Joseph",13.0,3rd Class Passenger,,Passenger,3rd,Child,Male,0

In [106]:
data.groupby(['Crew/Pass'])['Survival'].sum()*100/data.groupby(['Crew/Pass'])['Survival'].count()

Crew/Pass
Crew         13.586957
Passenger    35.798817
Name: Survival, dtype: float64

In [107]:
def compare(group,data):
    return data.groupby([group])['Survival'].sum()*100/data.groupby([group])['Survival'].count()

compare("Class",data)

Class
1st     57.428571
2nd     37.883959
3rd     24.259520
Crew    13.586957
Name: Survival, dtype: float64

In [108]:
compare("Gender",data)

Gender
Female    59.272097
Male      15.540181
Name: Survival, dtype: float64

In [109]:
compare("Adult/Child",data)

Adult/Child
Adult    25.078370
Child    33.183857
Name: Survival, dtype: float64

In [110]:
trainingData=data[["Age","Crew/Pass","Class","Adult/Child","Gender","Survival"]]
trainingData.head()

    Age  Crew/Pass Class Adult/Child  Gender  Survival
0  27.0  Passenger   3rd       Adult    Male         1
1  42.0  Passenger   3rd       Adult    Male         0
2  39.0  Passenger   3rd       Adult  Female         1
3  16.0  Passenger   3rd       Child    Male         0
4  13.0  Passenger   3rd       Child    Male         0

In [111]:
def catToNum(series):
    series = series.astype('category')
    return series.cat.codes

catData=trainingData[["Crew/Pass","Class","Adult/Child","Gender"]].apply(catToNum)
trainingData[["Crew/Pass","Class","Adult/Child","Gender"]]=catData
trainingData.head()

/home/renjith/anaconda3/envs/ml101/lib/python3.6/site-packages/pandas/core/frame.py:2540: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[k1] = value[k2]

    Age  Crew/Pass  Class  Adult/Child  Gender  Survival
0  27.0          1      2            0       1         1
1  42.0          1      2            0       1         0
2  39.0          1      2            0       0         1
3  16.0          1      2            1       1         0
4  13.0          1      2            1       1         0

In [112]:
len(trainingData)

2456

In [113]:
trainingData = trainingData.dropna()
len(trainingData)

2426

In [115]:
from sklearn.model_selection import train_test_split
train, test = train_test_split(trainingData, test_size = 0.2)

In [116]:
train.head()

       Age  Crew/Pass  Class  Adult/Child  Gender  Survival
1319  36.0          1      2            0       1         1
340   21.0          1      2            0       1         0
772   23.0          1      0            0       0         1
441   40.0          0      3            0       1         0
773   19.0          1      0            0       1         0

In [117]:
test.head()

       Age  Crew/Pass  Class  Adult/Child  Gender  Survival
1237  43.0          0      3            0       1         0
1678  39.0          0      3            0       1         0
1479  17.0          1      2            1       0         0
1961  27.0          1      2            0       1         0
880   46.0          1      0            0       1         0

In [118]:
len(train)

1940

In [119]:
len(test)

486

In [120]:
from sklearn.tree import DecisionTreeClassifier
clf=DecisionTreeClassifier(max_leaf_nodes=25)
clf=clf.fit(train[["Age","Crew/Pass","Class","Adult/Child","Gender"]],train["Survival"])

In [121]:
clf

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=25,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [122]:
clf.feature_importances_

array([0.21808253, 0.        , 0.28108528, 0.        , 0.50083219])

In [123]:
from sklearn import tree
with open("titanic.dot","w") as f:
    f = tree.export_graphviz(clf,
                            feature_names=["Age","Crew/Pass","Class","Adult/Child","Gender"],out_file=f)

In [124]:
predictions = clf.predict(test[["Age","Crew/Pass","Class","Adult/Child","Gender"]])

In [125]:
from sklearn.metrics import accuracy_score
accuracy_score(test["Survival"], predictions)

0.7942386831275721